Autodesk.Revit.DB.ElementFilter.PassesFilter(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Applies the filter to a given element.
document:
The document.
id:
The element id.
Returns:
True if the element is accepted by the filter.  False if the element is rejected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementFilter.PassesFilter(Autodesk.Revit.DB.Element)
Applies the filter to a given element.
element:
The element.
Returns:
True if the element is accepted by the filter.  False if the element is rejected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011